# Chapter 7

In [1]:
import numpy as np
import pandas as pd

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [3]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data[0] = None

In [6]:
from numpy import nan as NA

In [7]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [8]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])

In [11]:
cleaned = data.dropna()

In [12]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [13]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [14]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [15]:
data[4] = NA

In [16]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [17]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [18]:
df = pd.DataFrame(np.random.randn(7,3))

In [19]:
df.iloc[:4, 1] = NA

In [20]:
df.iloc[:2, 2] = NA

In [21]:
df

          0         1         2
0 -0.605598       NaN       NaN
1  0.650116       NaN       NaN
2  2.484587       NaN  0.242929
3  0.078820       NaN -0.360792
4  0.295560 -1.558219 -0.054614
5  1.205620 -0.804891  0.511080
6 -0.390725  0.240445 -1.208973

In [22]:
df.dropna()

          0         1         2
4  0.295560 -1.558219 -0.054614
5  1.205620 -0.804891  0.511080
6 -0.390725  0.240445 -1.208973

In [23]:
df.dropna(thresh=2)

          0         1         2
2  2.484587       NaN  0.242929
3  0.078820       NaN -0.360792
4  0.295560 -1.558219 -0.054614
5  1.205620 -0.804891  0.511080
6 -0.390725  0.240445 -1.208973

In [24]:
df.fillna(0)

          0         1         2
0 -0.605598  0.000000  0.000000
1  0.650116  0.000000  0.000000
2  2.484587  0.000000  0.242929
3  0.078820  0.000000 -0.360792
4  0.295560 -1.558219 -0.054614
5  1.205620 -0.804891  0.511080
6 -0.390725  0.240445 -1.208973

In [25]:
df.fillna({1:0.5, 2: 0})

          0         1         2
0 -0.605598  0.500000  0.000000
1  0.650116  0.500000  0.000000
2  2.484587  0.500000  0.242929
3  0.078820  0.500000 -0.360792
4  0.295560 -1.558219 -0.054614
5  1.205620 -0.804891  0.511080
6 -0.390725  0.240445 -1.208973

In [26]:
_ = df.fillna(0, inplace=True)

In [27]:
df

          0         1         2
0 -0.605598  0.000000  0.000000
1  0.650116  0.000000  0.000000
2  2.484587  0.000000  0.242929
3  0.078820  0.000000 -0.360792
4  0.295560 -1.558219 -0.054614
5  1.205620 -0.804891  0.511080
6 -0.390725  0.240445 -1.208973

In [28]:
df = pd.DataFrame(np.random.randn(6, 3))

In [29]:
df.iloc[2:, 1]= NA

In [30]:
df.iloc[4:, 2]= NA

In [31]:
df

          0         1         2
0 -0.107798 -1.704476 -0.671839
1 -2.145967  1.210483  1.101571
2 -0.081017       NaN -0.621122
3  0.282749       NaN  0.793079
4 -0.592895       NaN       NaN
5 -0.764978       NaN       NaN

In [32]:
df.fillna(method='ffill')

/var/folders/9f/51kqfykj067ddd68rlj_8mv40000gp/T/ipykernel_66819/1193302488.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill')

          0         1         2
0 -0.107798 -1.704476 -0.671839
1 -2.145967  1.210483  1.101571
2 -0.081017  1.210483 -0.621122
3  0.282749  1.210483  0.793079
4 -0.592895  1.210483  0.793079
5 -0.764978  1.210483  0.793079

In [33]:
df.fillna(method='ffill', limit=2)

/var/folders/9f/51kqfykj067ddd68rlj_8mv40000gp/T/ipykernel_66819/2719175769.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.107798 -1.704476 -0.671839
1 -2.145967  1.210483  1.101571
2 -0.081017  1.210483 -0.621122
3  0.282749  1.210483  0.793079
4 -0.592895       NaN  0.793079
5 -0.764978       NaN  0.793079

In [34]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [35]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [36]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})

In [37]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [38]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [39]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [40]:
data['v1'] = range(7)

In [41]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [42]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [43]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon',
         'pastrami', 'honey ham', 'nova lox'],
'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [44]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [45]:
meat_to_animal = {
      'bacon': 'pig',
      'pulled pork': 'pig',
      'pastrami': 'cow',
      'corned beef': 'cow',
      'honey ham': 'pig',
      'nova lox': 'salmon'
}

In [46]:
lowercased = data['food'].str.lower()

In [47]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [48]:
data['animal'] = lowercased.map(meat_to_animal)

In [49]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [50]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [51]:
data = pd.Series([1., -999., 2., -999., -1000, 3.])

In [52]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [53]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [54]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [55]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [56]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [57]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)), index=['Ohio', 'Colorado', 'New York'], columns=['one', 'two', 'three', 'four'])

In [58]:
transform = lambda x: x[:4].upper()

In [59]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [60]:
data.index = data.index.map(transform)

In [61]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [62]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [63]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [64]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

In [65]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [66]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [67]:
bins = [18, 25, 35, 60, 100]

In [68]:
cats = pd.cut(ages, bins)

In [69]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [70]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [71]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [72]:
pd.value_counts(cats)

/var/folders/9f/51kqfykj067ddd68rlj_8mv40000gp/T/ipykernel_66819/1485279302.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [73]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64, left]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [74]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [75]:
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [76]:
data = np.random.rand(20)

In [77]:
pd.cut(data, 4, precision=2)

[(0.64, 0.85], (0.22, 0.43], (0.64, 0.85], (0.22, 0.43], (0.64, 0.85], ..., (0.011, 0.22], (0.64, 0.85], (0.64, 0.85], (0.011, 0.22], (0.43, 0.64]]
Length: 20
Categories (4, interval[float64, right]): [(0.011, 0.22] < (0.22, 0.43] < (0.43, 0.64] < (0.64, 0.85]]

In [78]:
group_names = ['Youth', 'YounAdult', 'MiddleAged', 'Senior']

In [79]:
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YounAdult', 'Youth', ..., 'YounAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YounAdult']
Length: 12
Categories (4, object): ['Youth' < 'YounAdult' < 'MiddleAged' < 'Senior']

In [80]:
data = np.random.rand(20)

In [81]:
pd.cut(data, 4, precision=2)

[(0.5, 0.74], (0.035, 0.27], (0.74, 0.97], (0.27, 0.5], (0.035, 0.27], ..., (0.5, 0.74], (0.035, 0.27], (0.27, 0.5], (0.27, 0.5], (0.74, 0.97]]
Length: 20
Categories (4, interval[float64, right]): [(0.035, 0.27] < (0.27, 0.5] < (0.5, 0.74] < (0.74, 0.97]]

In [82]:
data = np.random.randn(1000)

In [83]:
cats = pd.qcut(data, 4)

In [84]:
cats

[(-0.69, 0.0138], (-3.645, -0.69], (-3.645, -0.69], (-0.69, 0.0138], (0.0138, 0.711], ..., (-0.69, 0.0138], (0.0138, 0.711], (-3.645, -0.69], (0.0138, 0.711], (-3.645, -0.69]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.645, -0.69] < (-0.69, 0.0138] < (0.0138, 0.711] < (0.711, 3.085]]

In [85]:
pd.value_counts(cats)

/var/folders/9f/51kqfykj067ddd68rlj_8mv40000gp/T/ipykernel_66819/1485279302.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(cats)

(-3.645, -0.69]    250
(-0.69, 0.0138]    250
(0.0138, 0.711]    250
(0.711, 3.085]     250
Name: count, dtype: int64

In [86]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-1.319, 0.0138], (-1.319, 0.0138], (-1.319, 0.0138], (-1.319, 0.0138], (0.0138, 1.284], ..., (-1.319, 0.0138], (0.0138, 1.284], (-1.319, 0.0138], (0.0138, 1.284], (-3.645, -1.319]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.645, -1.319] < (-1.319, 0.0138] < (0.0138, 1.284] < (1.284, 3.085]]

In [87]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [88]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.023997     0.031254     0.012780     0.051840
std       0.996031     1.042214     1.000728     0.981318
min      -2.982877    -3.315664    -3.281873    -3.005575
25%      -0.643543    -0.695068    -0.642938    -0.662453
50%      -0.006029     0.020717     0.047705     0.047327
75%       0.727977     0.734272     0.687434     0.778153
max       3.284955     3.115692     2.676907     3.619329

In [89]:
col = data[2]

In [90]:
col[np.abs(col) > 3]

352   -3.036032
622   -3.281873
Name: 2, dtype: float64

In [92]:
data[(np.abs(data) > 3).any(1)]

TypeError: DataFrame.any() takes 1 positional argument but 2 were given

In [93]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [94]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.023647     0.031422     0.013098     0.051226
std       0.994942     1.040818     0.999729     0.979240
min      -2.982877    -3.000000    -3.000000    -3.000000
25%      -0.643543    -0.695068    -0.642938    -0.662453
50%      -0.006029     0.020717     0.047705     0.047327
75%       0.727977     0.734272     0.687434     0.778153
max       3.000000     3.000000     2.676907     3.000000

In [95]:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0 -1.0 -1.0
1 -1.0  1.0  1.0  1.0
2 -1.0 -1.0  1.0  1.0
3  1.0 -1.0  1.0 -1.0
4 -1.0  1.0 -1.0  1.0

In [96]:
df = pd.DataFrame(np.arange(5 *4).reshape((5,4)))

In [97]:
sampler= np.random.permutation(5)

In [98]:
sampler

array([0, 1, 4, 2, 3])

In [99]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [100]:
df.take(sampler)

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
4  16  17  18  19
2   8   9  10  11
3  12  13  14  15

In [101]:
df.sample(n=3)

    0   1   2   3
0   0   1   2   3
4  16  17  18  19
2   8   9  10  11

In [102]:
choices = pd.Series([5, 7,-1, 6,4])

In [103]:
draws = choices.sample(n=10, replace=True)

In [104]:
draws

4    4
0    5
4    4
1    7
4    4
2   -1
1    7
1    7
2   -1
0    5
dtype: int64

In [105]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 'data1': range(6)})

In [107]:
pd.get_dummies(df['key'])

       a      b      c
0  False   True  False
1  False   True  False
2   True  False  False
3  False  False   True
4   True  False  False
5  False   True  False

In [114]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [115]:
df_with_dummy = df[['data1']].join(dummies)

In [116]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0  False   True  False
1      1  False   True  False
2      2   True  False  False
3      3  False  False   True
4      4   True  False  False
5      5  False   True  False

In [117]:
mnames = ['movie_id', 'title', 'genres']

In [121]:
movies = pd.read_table('examples/movies.dat', sep='::', header=None, names=mnames)

/var/folders/9f/51kqfykj067ddd68rlj_8mv40000gp/T/ipykernel_66819/1817561731.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  movies = pd.read_table('examples/movies.dat', sep='::', header=None, names=mnames)

In [122]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [123]:
all_genres = []

In [129]:
for x in movies.genres:
    all_genres.extend(x.split('|'))

In [131]:
genres = pd.unique(all_genres)

/var/folders/9f/51kqfykj067ddd68rlj_8mv40000gp/T/ipykernel_66819/1657210076.py:1: FutureWarning: unique with argument that is not not a Series, Index, ExtensionArray, or np.ndarray is deprecated and will raise in a future version.
  genres = pd.unique(all_genres)

In [132]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [133]:
zero_matrix = np.zeros((len(movies), len(genres)))

In [134]:
dummies = pd.DataFrame(zero_matrix, columns=genres)

In [135]:
gen= movies.genres[0]

In [136]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [137]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2])

In [138]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [139]:
movies_windic = movies.join(dummies.add_prefix('Genre'))

In [140]:
movies_windic.iloc[0]

movie_id                                      1
title                          Toy Story (1995)
genres              Animation|Children's|Comedy
GenreAnimation                              1.0
GenreChildren's                             1.0
GenreComedy                                 1.0
GenreAdventure                              0.0
GenreFantasy                                0.0
GenreRomance                                0.0
GenreDrama                                  0.0
GenreAction                                 0.0
GenreCrime                                  0.0
GenreThriller                               0.0
GenreHorror                                 0.0
GenreSci-Fi                                 0.0
GenreDocumentary                            0.0
GenreWar                                    0.0
GenreMusical                                0.0
GenreMystery                                0.0
GenreFilm-Noir                              0.0
GenreWestern                                0.0
Name: 0, dtype: object

In [141]:
np.random.seed(12345)

In [142]:
values = np.random.rand(10)

In [143]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [144]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [145]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0       False       False       False       False        True
1       False        True       False       False       False
2        True       False       False       False       False
3       False        True       False       False       False
4       False       False        True       False       False
5       False       False        True       False       False
6       False       False       False       False        True
7       False       False       False        True       False
8       False       False       False        True       False
9       False       False       False        True       False

In [146]:
val = 'a,b, guido'

In [147]:
val.split(',')

['a', 'b', ' guido']

In [149]:
['a', 'b', '  guido']

['a', 'b', '  guido']

In [150]:
pieces = [x.strip() for x in val.split(',')]

In [151]:
pieces

['a', 'b', 'guido']

In [152]:
first, second, third = pieces

In [154]:
first + '::' + second + '::' + third

'a::b::guido'

In [155]:
'::'.join(pieces)

'a::b::guido'

In [156]:
'guido' in val

True

In [157]:
val.index(',')

1

In [158]:
val.find(':')

-1

In [159]:
val.index(':')

ValueError: substring not found

In [160]:
val.count(',')

2

In [161]:
val.replace(',', '::')

'a::b:: guido'

In [162]:
val.replace(',', '')

'ab guido'

In [163]:
import re

In [164]:
text = "foo     bar\t baz   \tqux"

In [167]:
re.split('\\s+', text)

['foo', 'bar', 'baz', 'qux']

In [169]:
regex = re.compile('\\s+')

In [170]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [171]:
regex.findall(text)

['     ', '\t ', '   \t']

In [172]:
    text = """Dave dave@google.com
    Steve steve@gmail.com
    Rob rob@gmail.com
    Ryan ryan@yahoo.com
    """
    pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
    # re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [174]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [175]:
m = regex.search(text)

In [176]:
m

In [177]:
text[m.start():m.end()]

'dave@google.com'

In [178]:
print(regex.match(text))

None

In [181]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [182]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [183]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [184]:
m = regex.match('wesm@beright.net')

In [185]:
m.groups()

('wesm', 'beright', 'net')

In [186]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [187]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

In [188]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
       .....:         'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [189]:
data = pd.Series(data)

In [190]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [191]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [192]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [193]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [194]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [195]:
matches = data.str.match(pattern, flags=re.IGNORECASE)

In [196]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [198]:
matches.str.get(1)

AttributeError: Can only use .str accessor with string values!